for x in range(19):
    a = 7 * 19**7 + \
        8 * 19**6 + \
        x * 19**5 + \
        7 * 19**4 + \
        9 * 19**3 + \
        6 * 19**2 + \
        4 * 19**1 + \
        3 * 19**0
    b = 2 * 19**4 + \
        5 * 19**3 + \
        x * 19**2 + \
        4 * 19**1 + \
        3 * 19**0
    c = 6 * 19**3 + \
        3 * 19**2 + \
        x * 19**1 + \
        5 * 19**0

    d = a + b + c
    if d % 18 == 0: # % - остаток от деления на 18
        print(x, d // 18) # // - целочисленное деление
        #break # Прекратить выполнение цикла

#2 способ

s = '0123456789ABCDEFGHI'
for x in s:
    a = int('78' + x + '79643', 19)
    b = int('25' + x + '43', 19)
    c = int('63' + x + '5', 19)

    if (a + b + c) % 18 == 0:
        print(x, (a + b + c) // 18)
