chislo = abs(int(input()))
chislo_str = str(chislo)

if len(chislo_str) == 4:
    ##############################################
    print('Число чётное:', end=' ')
    if chislo % 2 == 0:
        print('Да')
    else:
        print('Нет')
    ##############################################
    print('Число кратное трём:', end=' ')
    if chislo % 3 == 0:
        print('Да')
    else:
        print('Нет')
    ##############################################
    print('Число является квадратом числа:', end=' ')
    if (chislo ** 0.5) == int(chislo ** 0.5):
        print(int(chislo ** 0.5))
    else:
        print('Нет')
    ##############################################
    print()
    ##############################################
    sp = list(map(int, chislo_str))
    print('Наименьшая цифра числа:', min(sp))
    print('Наибольшая цифра числа:', max(sp))
    print('Количество нулей в числе:', sp.count(0))
    ##############################################
    print()
    ##############################################
    razr = ['тысяч', 'сотен', 'десятков', 'единиц']
    kvadr = '0149'
    for i in range(3, -1, -1):
        print('Цифра в разряде', razr[i], 'является квадратом цифры:', end=' ')
        if chislo_str[i] in kvadr:
            print(int(int(chislo_str[i]) ** 0.5))
        else:
            print('Нет')
    ##############################################
else:
    print('Введённое число не является четырёхзначным')
